Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཤཱ་རིའི་བུ་རྒྱལ་པོ་མར་མེའི་བདག་གིས་རྩིས་པ་དང་། བློན་པོ་དང་། སྒོ་བ་དང་། འཁོར་རྣམས་བསགས་ཏེ དེ་ལྟར་གྱུར་པ་དག་བཟླས་པ་དང་། དེ་དག་གིས་ལྷ་དེ་ལྟར་ན་བཅོམ་ལྡན་འདས་དེ་ཉིད་ལ་གསོལ་ན་བཅོམ་ལྡན་འདས་དེ་ནི་ཐུགས་རྗེ་ཆེ་བས་ཐུགས་རྗེར་དགོངས་ཏེ། རྒྱལ་པོ་དགྲ་ཐུལ་གྱི་དྲུང་དུ་གཤེགས་པར་འགྱུར་ཏེ། རྒྱལ་པོ་དགྲ་ཐུལ་ཀྱང་འདིར་མི་མཆི་བར་འགྱུར་རོ་ཞེས་སྨྲས་པ་དང་།
en: “Śāriputra, the king Dīpapati now gathered his council of astrologers, ministers, councilors, and guards to inform them of the situation, and he told them, ‘The divine Lord should be approached and asked about this, about whether the great compassionate Lord will in fact, out of his love, go to see the king Jitaśatru. The king Jitaśatru should under no circumstance have to come here.’

source: ཤཱ་རིའི་བུ་དེ་ནས་རྒྱལ་པོ་མར་མེའི་བདག་པོ་བློན་པོ་དག་དང་འགྲོགས་ཏེ། བཅོམ་ལྡན་འདས་མར་མེ་མཛད་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། དེ་ལྟར་གྱུར་པ་དེ་དག་གསོལ་ཏོ། །
en: “Then, Śāriputra, the king Dīpapati, together with his ministers, went to the place where the Lord Dīpaṅkara was staying. When he arrived there, he honored the Lord by placing his head at his feet, and he then delivered the news.

source: དེ་སྐད་གསོལ་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་རྒྱལ་པོ་མར་མེའི་བདག་པོ་ལ་དེ་བས་ན་རྒྱལ་པོ་ཆེན་པོ་ཐུགས་བརྩེ་བའི་ཕྱིར་རྒྱལ་པོ་དགྲ་ཐུལ་གྱི་དྲུང་དུ་གཤེགས་སོ་ཞེས་བཀའ་སྩལ་ཏོ། ། ཤཱ་རིའི་བུ་དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ལྷ་རྫས་མཆོག་གི་རྒྱལ་པོའི་ཕོ་བྲང་དུ་ཇི་སྲིད་དགྱེས་པར་བཞུགས་ནས། དགྲ་བཅོམ་པ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཕྲག་བརྒྱད་བཅུ་རྩ་བཞི་དང་ཐབས་ཅིག་ཏུ་ཡུལ་རྒྱུ་ཞིང་གཤེགས་སོ། །
en: When he had spoken, the Lord, the Tathāgata Dīpaṅkara said this to the king Dīpapati, ‘Great king, out of love, I will present myself to the king Jitaśatru.’ “The lord, the tathāgata Dīpaṅkara, Śāriputra, had been living comfortably in the supremely divine royal palace, but he now set out to make this journey across the land together with eight hundred million arhats and eight million four hundred thousand bodhisatvas. The king Dīpapati and his fourfold army went with him as an escort to the border of the kingdom, and there he honored him with clothing, sustenance, bedding, seats, medicine for the sick, and utensils. He placed his head at the feet of the Lord, the Tathāgata Dīpaṅkara, circumambulated him three times, shed a few tears, and left.

source: རྒྱལ་པོ་མར་མེའི་བདག་པོ་ཡང་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་དང་བཅས་ཏེ་ ཞབས་འབྲིང་ཐོག་ཐག་ཏུ་འབྲང་ཞིང་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་འཁོར་དང་བཅས་པ་ལ་ན་བཟའ་དང་། བསོད་སྙོམས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་བཀུར་སྟི་བྱེད་ཅིང་བདག་གི་ཡུལ་གྱི་བར་དུ་ཞབས་འབྲིང་དུ་བྱས་ནས བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ནས་ ལན་གསུམ་བསྐོར་ཏེ་ མཆི་མ་བླགས་ནས་སླར་ལོག་པ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་དགྲ་བཅོམ་པ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་དང་ཐབས་ཅིག་ཏུ་རྒྱལ་པོའི་ཕོ་བྲང་པད་མ་ཅན་དུ་གཤེགས་པར་རྒྱལ་པོ་དགྲ་ཐུལ་གྱིས་ཐོས་སོ། ། དེ་ནས་རྒྱལ་པོ་དགྲ་ཐུལ་གྱིས་རྒྱལ་པོའི་ཕོ་བྲང་པད་མ་ཅན་བརྒྱན་ཏེ། ས་གཞི་དང་། ལམ་གྱི་བཞི་མདོ་དང་། སུམ་མདོ་དག་ལ་གསེག་མ་དང་། གྱོ་མོ་དག་སེལ་དུ་བཙུད་དེ་བསལ་ནས་ཕྱག་དར་དང་། ཆག་ཆག་འདེབས་སུ་བཙུད་དོ། ། སྤོས་ཆུའི་ཆག་ཆག་ཀྱང་འདེབས་སུ་བཙུད་དོ། ། མེ་ཏོག་བཀྲམ་པས་པུས་ནུབ་ཙམ་དུ་ཕྱིན་པར་བྱ་བ་བྱེད་དུ་བཙུད་དོ། ། བདུག་པའི་སྣོད་ནས་ཀྱང་རབ་ཏུ་བདུག་པ་བྱས་སོ། ། གོས་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་བླ་རེ་བྲེས། སིལ་སྙན་སྣ་ཚོགས་ཀྱང་དཀྲོལ་དུ་བཙུད་དོ། །
en: “The king Jitaśatru learned that the Lord, the tathāgata, arhat, fully accomplished Buddha Dīpaṅkara, was now on his way to the royal capital Padmāvatī together with a following of eight hundred million śrāvakas. The king Jitaśatru then had the royal capital Padmāvatī decorated. To the four corners of the city, at the places where three or four roads formed an intersection, he had gravel and stones cleared away, the surfaces swept and cleaned, and perfumed water sprinkled over them. He had flowers, piled knee-high, that one could walk upon, and he set up incense burners that spread their fragrance. He had canopies made of different kinds of precious fabrics erected, and various instruments were played. As the king Jitaśatru had decorated the royal capital Padmāvatī, he then gave the order that any flowers, scents, or ointments available within the royal capital should not be used up and should not be sold, but should all be offered in honor of the Lord Dīpaṅkara. He further ordered that anyone who used up or traded these things would be severely punished.

source: དེ་ནས་རྒྱལ་པོ་དགྲ་ཐུལ་གྱིས་རྒྱལ་པོའི་ཕོ་བྲང་པད་མ་ཅན་བརྒྱན་ནས་ གང་རྒྱལ་པོའི་ཕོ་བྲང་པད་མ་ཅན་ཀུན་ན་མེ་ཏོག་དང་། དྲི་དང་། བྱུག་པ་ཡོད་པ་རྣམས་སུས་ཀྱང་མ་སྤྱད་ཅིག ། མ་བཙོང་ཤིག །དེ་ཐམས་ཅད་བཅོམ་ལྡན་འདས་མར་མེ་མཛད་ལ་འབུལ་ཞིང་མཆོད་པའི་ལས་སུ་གྱིས་ཤིག །ལ་ལ་ཞིག་སྤྱོད་དམ་འཚོང་ན་དེ་ནི་ཆད་པ་ཆེན་པོས་བཅད་དོ་ཞེས་སྒྲ་བསྒྲགས་སོ། ། དེ་ནས་རྒྱལ་པོ་དགྲ་ཐུལ་གྱིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བའི་ཕྱིར་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་དང་བཅས་ཏེ། མེ་ཏོག་དང་། དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་དཀྲོལ་བ་དང་། རྒྱལ་པོའི་མཐུ་ཆེན་པོ་དང་། རྒྱལ་པོའི་འབྱོར་པ་ཆེན་པོས་རྒྱལ་པོའི་ཕོ་བྲང་པད་མ་ཅན་ནས་ཕྱིར་བྱུང་ངོ་། །པ་དམ་ཅན་གྱི་བྲམ་ཟེ་དང་། ཁྱིམ་བདག་རྣམས་ཀྱང་བཅོམ་ལྡན་འདས་དེ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་དེའི་ཞབས་ལ་ཕྱག་འཚལ་ཏེ། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། དྲི་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས། བློན་པོ་དང་། འཁོར་དང་། བྲམ་ཟེ་དང་། ཁྱིམ་བདག་དེ་དག་གིས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ཏེ་ཞབས་འབྲིང་དུ་འབྲང་བ་དང་། རྒྱལ་པོ་དགྲ་ཐུལ་སེམས་དགའ། སེམས་མགུ། སེམས་ལ་སྒྲིབ་པ་མེད། སེམས་རངས་པར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་འབྲིང་དུ་འབྲང་ངོ་། །
en: “Then King Jitaśatru, together with his fourfold army, left his royal residence in Padmāvatī to meet the Lord, the Tathāgata Dīpaṅkara, and welcome him with flowers, incense, garlands, ointments, aromatic powders, cloth, parasols, royal banners, flags, the sounds of various instruments, his royal powers, and his royal magical abilities. The brahmins and householders of Padmāvatī also came out to see the arrival of the Lord. They prostrated themselves to the feet of the Lord, the Tathāgata Dīpaṅkara, and honored the Lord with flowers, garlands, incense, ointments, aromatic powders, cloth, parasols, royal banners, and flags. The ministers, attendants, brahmins, and householders honored the Lord by placing their heads at his feet, and when they had presented their offerings to him, they joined the procession toward the city. King Jitaśatru was pleased, happy, serene, and overjoyed as he escorted the Lord.

source: ཡང་དེའི་ཚེ་ན་གངས་རིའི་ངོས་ལ་བྲམ་ཟེ་རིན་པོ་ཞེས་བྱ་བ་གཡོག་བྲམ་ཟེ་གཞོན་ནུ་ལྔ་བརྒྱ་ཡོད་པ། ཀློག་ཏུ་འཛུད་པའི་མཁན་པོ་སྔགས་འཆང་བ། རིག་བྱེད་གསུམ་པོ་སྒྲ་ངེས་པར་སྦྱོར་བ་དང་བཅས་པ་དང་། ཤེས་གསལ་དང་བཅས་པ་དང་། ཡི་གེ་རབ་ཏུ་དབྱེ་བ་དང་བཅས་པ་དང་། སྔོན་བྱུང་བ་ལྔ་པ་རྣམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཚིག་རེ་རེ་ཞིང་ལུང་བསྟན་པ་དང་། འཇིག་རྟེན་རྒྱང་པ་ན་པ་དང་། མཆོད་སྦྱིན་གྱི་རྒྱུད་དང་། སྐྱེས་བུ་ཆེན་པོའི་མཚན་རྗེས་སུ་རྟོགས་པ། རང་གི་ཚིག་རབ་ལ་གསུམ་རིག་པ་དང་། སློབ་དཔོན་དུ་གྱུར་པར་ཡོངས་སུ་ཤེས་པ་ཞིག་གནས་ཏེ
en: “At that time, there was a brahmin by the name of Ratna who was living on the slopes of the mountain Himavat together with five hundred apprentice brahmins. He was a preceptor, a master of mantras, and adept in the Vedic scriptures, and he had clear insight. He had mastery of the five legendary accounts and could explain them word by word as they were analyzed into syllables and words. He was an unblemished authority on the materialist philosophy, on the scriptures regarding sacrifice, and on the characteristic marks of a great being, and he had a complete understanding of the threefold knowledge as presented by the scholars of his own tradition.

source: ཤཱ་རིའི་བུ་ཡང་བྲམ་ཟེ་རིན་པོ་ཆེ་དེ་ལ་བྲམ་ཟེ་གཞོན་ནུ་སྤྲིན་ཅེས་བྱ་བ་ཉེ་གནས་བྱེད་པ། ཀློག་ཏུ་འཇུག་པ། སྔགས་འཆང་བ། རིག་བྱེད་གསུམ་པོ་སྒྲ་ངེས་པར་སྦྱོར་བ་དང་བཅས་པ་དང་། ཤེས་གསལ་དང་བཅས་པ་དང་། ཡི་གེ་རབ་ཏུ་དབྱེ་བ་དང་བཅས་པ་དང་། སྔོན་བྱུང་བ་ལྔ་པ་རྣམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚིག་རེ་རེ་ཞིང་ལུང་སྟོན་པ་དང་། འཇིག་རྟེན་རྒྱང་པ་ན་པ་དང་། མཆོད་སྦྱིན་གྱི་རྒྱུད་དང་། སྐྱེས་བུ་ཆེན་པོའི་མཚན་རྗེས་སུ་རྟོགས་པ་ཁ་ན་མ་ཐོ་བ་མེད་པ། རང་གི་ཚིག་རབ་ལ་གསུམ་རིག་པ་དང་། སློབ་དཔོན་དུ་གྱུར་པར་ཡོངས་སུ་ཤེས་པ་ཞིག་ཡོད་དོ། །
en: “Together with the brahmin Ratna, Śāriputra, there lived a younger brahmin named Megha. He was a preceptor, a master of mantras, and adept in the Vedic scriptures, and he had clear insight. He had mastery of the five legendary accounts and could explain them word by word as they were analyzed into syllables and words. He was an authority on materialist philosophy, on the scriptures regarding sacrifice, and on the characteristic marks of a great being, and he had a complete understanding of the threefold knowledge as presented by the scholars of his own tradition.

source: ཤཱ་རིའི་བུ་དེ་ནས་བྲམ་ཟེ་གཞོན་ནུ་སྤྲིན་ཅེས་བྱ་བ་རིག་བྱེད་ལོབས་ནས་མཁན་པོ་ལ་ཀྱེ་མཁན་པོ་བདག་གིས་རིག་བྱེད་ལོབས་ཏེ་བདག་ནི་ཡུལ་དུ་མཆི་ན་བདག་གིས་བགྱི་བ་ཅི་མཆིས་ཞེས་དེ་སྐད་སྨྲས་པ་དང་། ཀྱེ་བུ་སྤྲིན་སློབ་དཔོན་ལ་ནོར་འགྲོན་བུ་ལྔ་བརྒྱ་བྱིན་ཅིག་ཅེས་དེས་དེ་སྐད་སྨྲས་སོ། །
en: “Śāriputra, when the young brahmin Megha had mastered the Vedas, he addressed his preceptor Ratna with these words: ‘O preceptor, I have mastered the Vedas, and I will now return to my own country. What should I do?’ “He answered, ‘My son Megha, you should pay the teacher’s fee of five hundred karṣāpaṇa.’

source: དེ་ནས་བྲམ་ཟེ་གཞོན་ནུ་སྤྲིན་གྱིས་མཁན་པོའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་ལན་གསུམ་བསྐོར་ནས་མཁན་པོའི་དྲུང་ནས་སོང་སྟེ། དེ་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། རྒྱལ་པོའི་ཕོ་བྲང་དག་ན་རྒྱུ་ཞིང་སློབ་དཔོན་ལ་དབུལ་བའི་སློབ་དཔོན་གྱི་ནོར་བཙལ་ཏེ། དེས་སློབ་དཔོན་ལ་དབུལ་བའི་སློབ་དཔོན་གྱི་ནོར་བསྡུས་ནས་མཐར་གྱིས་རྒྱལ་པོའི་ཕོ་བྲང་པད་མ་ཅན་དུ་ཕྱིན་ཏེ། བྲམ་ཟེ་གཞོན་ནུ་སྤྲིན་གྱིས་རྒྱལ་པོའི་ཕོ་བྲང་པད་མ་ཅན་ཀུན་བརྒྱན་པར་མཐོང་ངོ་། ། མཐོང་ནས་མི་ཞིག་བོས་ཏེ། ཀྱེ་སྐྱེས་བུ་རྒྱལ་པོའི་ཕོ་བྲང་པད་མ་ཅན་འདིར་ཅིའི་དགའ་སྟོན་ཞིག་གཡོས་པར་གྱུར་ཅེས་སྨྲས་པ་དང་། དེས་གཞོན་ནུ་ཁྱོད་ཀྱིས་མི་ཤེས་སམ།
en: “Then the young brahmin Megha saluted the feet of his preceptor, circumambulated him three times, and left. He traveled to many cities, towns, villages, countries, kingdoms, and royal courts searching for the money for his teacher’s fee. When he had spent some time collecting money for his teacher’s fee in this way, he arrived at the royal capital Padmāvatī. The young brahmin Megha saw how the royal capital Padmāvatī had been decorated, and he asked a passerby, ‘My good man, is there a festival here in the capital Padmāvatī?’

source: དེ་རིང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་དགྲ་བཅོམ་པ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་དང་ཐབས་ཅིག་ཏུ་རྒྱལ་པོའི་ཕོ་བྲང་པད་མ་ཅན་དུ་གཤེགས་ཏེ དེའི་ཕྱིར་རྒྱལ་པོའི་ཕོ་བྲང་པད་མ་ཅན་འདི་ཀུན་བརྒྱན་ཏོ། ། དེ་ལ་མི་དག་སྦྱིན་པ་ཡང་སྦྱིན་པར་བྱེད། བསོད་ནམས་དག་ཀྱང་བྱེད་དོ། །
en: “The man answered, ‘Have you not heard, young man? Today the Lord, the tathāgata, arhat, fully accomplished Buddha Dīpaṅkara, is coming to the capital Padmāvatī, together with eight hundred million śrāvakas and eight million four hundred thousand bodhisatvas. This is why the capital Padmāvatī has been decorated. The people who live here will make offerings and thus gain merit.’

source: ཞེས་དེ་སྐད་སྨྲས་པ་དང་། དེ་ནས་བྲམ་ཟེ་སྤྲིན་གཞོན་ནུས་སངས་རྒྱས་ཀྱི་སྒྲ་ཐོས་ནས་ དགའ་བ་དང་། དང་བ་དང་། མགུ་བ་ཆེར་སྐྱེས་ནས་ སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འབྱུང་བ་དཀོན་ཏེ། ཤིན་ཏུ་དཀོན་པ་ཨུ་དུམ་བ་རའི་མེ་ཏོག་དང་འདྲ་བ། མཆོད་སྦྱིན་གྱི་ཤིང་གཅིག་པུའི་ཚུལ་ལྟ་བུ་ཡིན་པས་གང་བདག་གིས་ཀཱར་ཤཱ་པཎ་ལྔ་བརྒྱ་པོ་འདིས་མེ་ཏོག་ཉོས་ཏེ བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ལ་མེ་ཏོག་གཏོར་ལ་སློབ་དཔོན་གྱི་ནོར་གུད་ནས་བཙལ་ལོ་སྙམ་མོ། །
en: “Śāriputra, when the young brahmin Megha heard the man mention the Buddha, great joy, serenity, and delight arose in him, and he thought, ‘It is difficult to encounter the lords, the buddhas. It is truly difficult, extremely difficult. It is an occurrence as rare as the appearance of the udumbara flower. It is just like in the example of the single yoke. I should spend these five hundred karṣāpaṇa on flowers to scatter in honor of the Tathāgata Dīpaṅkara, and then go and collect more money to pay my preceptor’s fee.’

source: ཡང་དེའི་ཚེ་ན་བུ་མོ་ཞིག་མེ་ཏོག་ཨུད་པལ་བདུན་ཁྱེར་ཏེ་ལམ་གྱི་སྲང་ནས་སོང་བ་དང་། དེ་ནས་བྲམ་ཟེ་གཞོན་ནུ་སྤྲིན་གྱིས་བུ་མོ་དེ་ལ་ཀྱེ་བུ་མོ་ཆུ་ནས་བྱུང་བའི་མེ་ཏོག་གང་ནས་རྙེད་པར་འགྱུར་ཞེས་དེ་སྐད་སྨྲས་པ་དང་། དེས་ཕྱོགས་ཆེ་གེ་མོ་ཞིག་ན་ཕྲེང་བ་བྱེད་པའི་ཁང་པ་ནས་བདག་གིས་ཀཱར་ཤ་པཎ་ལྔ་བརྒྱས་ཉོས་སོ་ཞེས་སྨྲས་སོ། །
en: “It so happened then that a girl was walking along the road carrying seven blue lotus flowers, and the young brahmin Megha addressed her: ‘Young girl, where did you get these lotus flowers from?’ “She replied, ‘I bought them for five hundred karṣāpaṇa from some gardener’s shop—I do not know his name.’

source: དེ་ནས་བྲམ་ཟེ་གཞོན་ནུ་སྤྲིན་གྱིས་བུ་མོ་དེ་ལ་མེ་ཏོག་ཆུ་ནས་སྐྱེས་པ་འདི་དག་ཇི་ཙམ་གྱིས་ཉོས་པ་བཞིན་དུ་ང་ལ་ཚོང་ཤིག་ཅེས་དེ་སྐད་སྨྲས་པ་དང་། དེས་དེ་ལྟར་མི་རུང་ངོ་ཞེས་སྨྲས་ནས དེས་འོ་ན་གཉིས་ཁྱོད་ལ་ཞོག་ལ་ལྔ་ང་ལ་ཀཱ་ཤ་པཎ་ལྔ་བརྒྱས་ཉོར་བྱིན་ཅིག་ཅེས་སྨྲས་ནས། དེས་འདི་དག་གིས་ཅི་བྱ་ཞེས་སྨྲས་པ་དང་། དེས་བཅོམ་ལྡན་འདས་མར་མེ་མཛད་ལ་གཏོར་བར་བྱའོ་ཞེས་སྨྲས་སོ། ། དེས་གལ་ཏེ་ཁྱོད་སྲིད་པའི་འགྲོ་བ་འཆི་འཕོ་བ་ཐམས་ཅད་དུ་བདག་གི་ཁྱིམ་ཐབ་ཏུ་འགྱུར་བར་དམ་འཆའ་ན་སྦྱིན་ནོ། །
en: “The young brahmin Megha then said to the girl, ‘Could you give me these flowers that you have bought?’ “ ‘Certainly not,’ she replied. “He then said, ‘Keep two for yourself, and then I will buy the other five for five hundred karṣāpaṇa.’ “ ‘Why would you do that?’ she asked. “He replied, ‘I am going to scatter them in honor of the Lord Dīpaṅkara.’ “ ‘I will give them to you,’ she said, ‘if you promise to be my husband throughout all future existences.’

source: དེས་བུ་མོ་ཐོང་ཁྱོད་དེ་སྐད་མ་ཟེར་ཅིག ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཁྱོད་ནི་གཡེང་ཞིང་རྒོད་པའོ། ། བུ་མོ་བླ་ན་མེད་པའི་སངས་རྒྱས་ཀྱི་ཆོས་གྲངས་མེད་པ་ནི་བསྐལ་པ་གྲངས་མེད་པས་བསྒྲུབ་དགོས་ཏེ། དེའི་ཕྱིར་འདི་ལྟ་སྟེ། འགྲོན་བུ་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻདཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་ཆེན་པོ་དང་། གསེར་དང་། དངུལ་དང་ལྡན་པ་དང་། རྟ་དང་། གླང་པོ་ཆེ་དང་། བོང་བུ་དང་། བ་ལང་དང་། ལུག་དང་། རྒྱལ་སྲིད་ཀྱང་ཡོངས་སུ་གཏང་བ་དང་། ཤིང་རྟ་ཡོངས་སུ་གཏང་བ་དང་། སླས་ཡོངས་སུ་གཏང་བ་དང་། བུ་ཕོ་དང་། བུ་མོ་ཡོངས་སུ་གཏང་བ་དང་། ལག་པ་ཡོངས་སུ་གཏང་བ་དང་། རུས་པ་དང་། རྐང་དང་། གཙུག་ཕུད་ཡོངས་སུ་གཏང་བ་དང་། རྣ་བ་དང་། སྣ་དང་། མིག་དང་། ཡན་ལག་མཆོག་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་བྱིན་པར་བྱ་སྟེ མདོར་ན་བུ་མོ་ནང་ངམ་ཕྱིའི་དངོས་པོ་གང་ཡང་བདག་གིས་ཡོངས་སུ་མི་གཏང་བར་བྱ་བ་མེད་དེ། བུ་མོ་གང་བདག་གིས་ཁྱོད་ཀྱང་ཡོངས་སུ་གཏང་སྟེ། དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་འབྱུང་བའི་དུས་དང་ཚོད་དུ་གྱུར་ན། ཁྱོད་ནི་གཡེང་ཞིང་རྒོད་ཀྱིས་ཁྱོད་ངའི་སྦྱིན་པའི་བར་ཆད་མ་བྱེད་ཅིག་ཅེས་དེ་སྐད་སྨྲས་པ་དང་། དེས་གལ་ཏེ་ ཁྱོད་ལུས་ལས་ཤ་ཡུངས་ཀར་གྱི་འབྲུམ་བུ་ཙམ་དུ་བཅད་དེ ང་ལ་བྱིན་དུ་ཟིན་ཀྱང་ངས་ཁྱོད་ཀྱི་སྦྱིན་པའི་བར་ཆད་མི་བྱའོ། །
en: “ ‘Certainly not, young girl,’ he replied. ‘I will not promise that. Why? You are wanton and fickle. Young girl, I have to master the unsurpassed innumerable qualities of the buddhas throughout innumerable eons. To do that, I have to give gifts such as coins, jewels, pearls, gems, conches, crystal, coral, silver, and gold. I have to give up such things as elephants, horses, cattle, donkeys, sheep, and even my royal status. I have to give up my carriages. I have to give up my children and my wives. I have to give up my hands. I have to give up my bones, my marrow, and my skull. I have to give up my ears, my nose, my eyes, and my head. In short, young girl, there is no way for me to avoid giving up everything internal and everything external. Young girl, I would even have to give you up. The time has now come for me to follow my conviction and, relying on the teachings of the Tathāgata, leave the household life behind and become a renunciant. Please do not make it difficult, because of your inconsistent and unreliable nature, for me to make an offering.’ “She said, ‘Well then, if you cut a piece of flesh the size of a mustard seed from your body and give it to me, I will not make it difficult for you to make an offering.’

source: ཞེས་སྨྲས་ནས་དེས་དེ་ལ་དེ་ལྟར་གྱུར་ཅིག ། ཆུ་ལས་སྐྱེས་པའི་མེ་ཏོག་དག་ང་ལ་བྱིན་ཅིག་ཅེས་སྨྲས་པ་དང་། དེས་ཀྱང་བྱིན་ནོ། །
en: “ ‘That is fine,’ he said. ‘You will then give me the lotus flowers?’ “ ‘Yes,’ she said. ‘Then I will give them to you.’

source: དེ་ནས་བྲམ་ཟེ་གཞོན་ནུ་སྤྲིན་གྱིས་མེ་ཏོག་ཨུད་པ་ལ་དེ་དག་བླངས་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ག་ལ་བ་དེར་སོང་སྟེ། བྲམ་ཟེ་གཞོན་ནུ་སྤྲིན་གྱིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མས་བསྐོར་ཅིང་མདུན་དུ་བདར་བ་མཐོང་སྟེ། སྤྱོད་ལམ་མཛེས་པའི་བར་དུ་རྒྱས་པར་བྱའོ། ། དེ་བཅོམ་ལྡན་འདས་ལ་སེམས་དང་བར་གྱུར་ཏོ། ། དེ་སེམས་དང་བར་གྱུར་ནས་ཤིན་ཏུ་དགའ་བ་དང་། དང་བ་དང་། བཀུར་སྟི་བསྐྱེད་ནས་བཅོམ་ལྡན་འདས་མར་མེ་མཛད་ག་ལ་བ་དེར་སོང་སྟེ།
en: “The young brahmin Megha acquired the blue lotus flowers in this way, and he then proceeded to where the Lord, the Tathāgata Dīpaṅkara, was. The brahmin Megha saw the Lord, the Tathāgata Dīpaṅkara, at the head of a crowd of many hundreds of thousands of millions of billions of beings, conducting himself with grace, and so forth, and his devotion for the Lord grew. Because of his devotion, great joy, serenity, and respect arose in him, and with this he approached the Lord Dīpaṅkara.

source: བྲམ་ཟེ་གཞོན་ནུ་སྤྲིན་གྱིས་མི་མང་པོ་དག་གིས་གོས་བཟང་པོ་བཟང་བ་དག་བཅོམ་ལྡན་འདས་མར་མེ་མཛད་ཀྱི་དྲུང་དུ་བཀྲམ་པ་མཐོང་ནས་ དེས་བདག་ལ་གོས་མེད་ཀྱིས། གང་བདག་གིས་རི་དགས་ཀྱི་པགས་པ་འདི་གདིང་ངོ་སྙམ་ནས་ དེས་རི་དགས་ཀྱི་པགས་པ་དེ་བཏིང་བ་དང་། དེ་ན་མི་དག་འདི་འདྲ་བའི་སེམས་ཅན་དཀོན་མཆོག་གི་དྲུང་དུ་རི་དགས་ཀྱི་པགས་པ་བཏིང་ངམ་ཞེས་འཕྱ་ཞིང་བཏིང་བ་ཡང་རྟུལ་བར་བྱེད་དོ། །
en: “The young brahmin Megha could see that many people had spread pieces of fine cloth in front of the Lord Dīpaṅkara, and he thought, ‘As I do not have any cloth, I will offer a piece of this deerskin.’ However, people then derided him and scolded him for his offering, saying, ‘How can you offer a deerskin to this jewel-like being?’

source: དེ་ནས་བྲམ་ཟེ་གཞོན་ནུ་སྤྲིན་ཕྱོགས་ཀྱི་མཐའ་ག་ལ་བ་དེར་སོང་སྟེ་ ཕྱིན་ནས་ རི་དགས་ཀྱི་པགས་པ་བཏིང་སྟེ་ དགོངས་ཤིག །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀུན་ནས་སྤྱན་རི་དགས་ཀྱི་པགས་པ་འདི་ལ་ཞབས་གཞག་པར་མཛོད་ཅིག་ཅེས་སེམས་བསྐྱེད་པ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་དགོངས་ནས་བྲམ་ཟེ་གཞོན་ནུ་སྤྲིན་གྱི་རི་དགས་ཀྱི་པགས་པ་ལ་ཞབས་གཞག་གོ །
en: “The young brahmin Megha went over to one side, offered his deerskin there, and formed the aspiration in his mind, ‘Please accept this Lord, Tathāgata Dīpaṅkara, universal seer. May you place your feet on this deerskin.’ “The Lord, the Tathāgata Dīpaṅkara, understood, and he thought, ‘I shall place my feet on the young brahmin Megha’s deerskin.’

source: དེ་ནས་བྲམ་ཟེ་གཞོན་ནུ་སྤྲིན་དགའ་མགུ་ར་ངས་རབ་ཏུ་དགའ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས་ དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ལ་མེ་ཏོག་ཨུད་པ་ལ་ལྔ་གཏོར་བ་དང་། ལྷའི་བུ་བརྒྱ་ཕྲག་དུ་མས་ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་དང་། ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ལྷའི་ཙན་དན་གྱི་ཕྱེ་མ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ལ་མངོན་པར་གཏོར། ལྷའི་སིལ་སྙན་རྣམས་དཀྲོལ། ལྷའི་གླུ་དབྱངས་བླངས་ནས་ བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ལ་བསྟི་སྟང་བྱ་བའི་ཕྱིར་མེ་ཏོག་ཨུད་པ་ལ་དེ་དག་ཨུད་པ་ལ་སྟོང་ཕྲག་དུ་མར་བྱས་ཏེ མེ་ཏོག་གི་བླ་རེ་འདབ་མ་མཐུར་དུ་ལྟ། སྡོང་བུ་གྱེན་དུ་ལྟ་བར་བྱས་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ལ་མངོན་པར་གཏོར་ཏེ།
en: “At that, the young brahmin Megha was happy and rejoiced, and he joyfully showered the Tathāgata Dīpaṅkara with the blue lotus flowers. Many hundreds of gods showered the Lord, the Tathāgata Dīpaṅkara, with divine mandārava flowers, divine blue lotus flowers, divine pink lotus flowers, and divine aromatic sandal powder. Divine music played and divine songs carried forth, all in honor of the Lord, the Tathāgata Dīpaṅkara. The blue lotuses became many thousands of lotus flowers, and this canopy of flowers showered down around the Lord, the tathāgata, arhat, fully accomplished Buddha Dīpaṅkara, falling with petals down and stalks pointing up.

source: འདི་ལྟ་སྟེ། བྲམ་ཟེ་གཞོན་ནུ་སྤྲིན་སེམས་དང་ནས་བཅོམ་ལྡན་འདས་མར་མེ་མཛད་ཀྱི་སྤྱན་སྔར་ལོ་བཅུ་གཉིས་སུ་རལ་པ་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་བཏིང་ནས། བདག་མ་འོངས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འགྱུར་ཞེ་ན། བཅོམ་ལྡན་འདས་ཀྱིས་བདག་དབུགས་དབྱུང་བར་མཛོད་ཅིག ། བདག་ལ་ཕྱག་གིས་དྲང་བར་གསོལ་ཞེས་ཡི་དམ་བརྟན་པར་བྱས་སོ། ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་བདག་གི་རལ་པ་གསེར་གྱི་ཁ་དོག་ལྟ་བུའི་སྟེང་དུ་ཞབས་མི་འཇོག་ཅིང་བདག་ལ་དབུགས་འབྱིན་པར་མི་མཛད། བདག་ལ་བྱང་ཆུབ་ཏུ་ལུང་ཡང་མི་སྟོན་ན་དེའི་ཕྱིར་བ་དག་འདི་ཉིད་དུ་ལུས་བསྐམ་པར་བགྱིའོ། ། ཞེས་ཡི་དམ་ཡང་བཅས་སོ། །
en: “So it was that the young brahmin Megha, with pure intentions, presented the golden-colored locks of hair that he had allowed to grow for twelve years to the Lord Dīpaṅkara and made this firm commitment: ‘Will I become a tathāgata, arhat, fully accomplished buddha in the future? Lord, please confirm this. Please give me a sign. If the Lord, the Tathāgata Dīpaṅkara, does not place his feet on my golden-colored locks of hair, if he does not grant me this confirmation, if he does not give me a prediction of awakening, I will physically wither up.’

source: ཤཱ་རིའི་བུ་དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀུན་ནས་སྤྱན། ཀུན་ནས་མཁྱེན་པ་དུས་གསུམ་གང་ཡང་མི་མཁྱེན་པ་ཅུང་ཟད་ཀྱང་མི་མངའ་བ་དེས་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་གྱི་བསམ་པ་མཁྱེན་ནས་ བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་གྱི་སྐྲ་རལ་བ་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་ལ་ཞབས་བཞག་སྟེ གཡས་ཕྱོགས་ནས་གླང་པོ་ཆེའི་གཟིགས་པས་གཟིགས་ཏེ། ཉན་ཐོས་ཀྱི་དགེ་འདུན་དེ་ལ་དགེ་སློང་དག་རལ་པ་རྣམས་ལ་རྐང་པ་མ་བཞག་ཤིག །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དགེ་སློང་དག་བྲམ་ཟེའི་ཁྱེའུ་འདི་ནི་བསྐལ་པ་གྲངས་མེད་པ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་བཀའ་སྩལ་ཏོ། །
en: “At that, Śāriputra, the Lord, the tathāgata, arhat, fully accomplished Buddha Dīpaṅkara, the universal seer, the omniscient one, the one for whom nothing in the three times is unknown, understood the intentions of the young brahmin Megha, and so he placed his feet on the young brahmin Megha’s golden-colored locks of hair. Then, with the gaze of an elephant, he looked up and addressed the whole assembly of śrāvakas: ‘Mendicants, you should not step on this hair. Why not? Mendicants, innumerable eons from now, this young brahmin will become a tathāgata, arhat, fully accomplished buddha by the name of Śākyamuni.’

source: ཤཱ་རིའི་བུ་དེ་ལྟར་བྲམ་ཟེའི་ཁྱེའུ་སྤྲིན་གྱིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ལས་ལུང་བསྟན་པ་ཐོས་ནས་ དགའ་ཞིང་མགུ་ནས་ སྟེང་གི་བར་སྣང་གི་ནམ་མཁའ་ལ་མངོན་པར་འཕགས་ཏེ
en: “So it was, Śāriputra, that the young brahmin Megha received a prediction from the Lord, the Tathāgata Dīpaṅkara, and he was so happy and thrilled that he flew up into the sky.
